{
    "status": "ok",
    "totalResults": 8341,
    "-articles": [
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "thestreet.com",
    "title": "Tesla Rival Chevy Rolls Out Electric Version of a Classic Model",
    "description": "Get Free Report first introduced its Cybertruck electric pickup prototype in November 2019, it was described as a vehicle similar to one in the films \"Mad Max\" and \"Blade Runner.\" CEO Elon Musk said the development of the Cybertruck was influenced by the amph…",
    "url": "https://biztoc.com/x/fe01ef6fda8b9ffd",
    "urlToImage": "https://c.biztoc.com/p/fe01ef6fda8b9ffd/s.webp",
    "publishedAt": "2023-07-01T20:36:07Z",
    "content": "Get Free Report first introduced its Cybertruck electric pickup prototype in November 2019, it was described as a vehicle similar to one in the films \"Mad Max\" and \"Blade Runner.\" CEO Elon Musk said … [+293 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "newsweek.com",
    "title": "Elon Musk places \"temporary limits\" on unverified Twitter accounts",
    "description": "Elon Musk announced \"temporary limits\" on all Twitter accounts as tens of thousands of the social media giant's users reported outages on Saturday. Musk—whose purchase of the social media company last year has come under significant scrutiny amid an increase …",
    "url": "https://biztoc.com/x/d1f6db9823a82b6c",
    "urlToImage": "https://c.biztoc.com/p/d1f6db9823a82b6c/s.webp",
    "publishedAt": "2023-07-01T20:26:02Z",
    "content": "Elon Musk announced \"temporary limits\" on all Twitter accounts as tens of thousands of the social media giant's users reported outages on Saturday.Muskwhose purchase of the social media company last … [+296 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Minneapolis Star Tribune"
    },
    "author": "Tamia Fowlkes and Julian Mark, The Washington Post",
    "title": "Elon Musk sets new daily Twitter limits for users",
    "description": "Follow the StarTribune for the news, photos and videos from the Twin Cities and beyond.",
    "url": "https://www.startribune.com/twitter-elon-musk-sets-new-daily-limits/600286857/",
    "urlToImage": "https://chorus.stimg.co/24765464/merlin_71173697.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
    "publishedAt": "2023-07-01T19:41:28Z",
    "content": "Elon Musk announced Saturday that Twitter will temporarily limit the number of tweets users can read per day depending on whether they are paid subscribers - to combat computer programs that comb thr… [+1060 chars]"
    }
]
}